{{- if eq .location "home" }}

cask_args appdir: '/Applications' 
tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
brew "ack"
brew "openssl@1.1"
brew "python@3.11"
brew "cffi"
brew "docutils"
brew "awscli"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "libssh2"
brew "curl"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "jena"
brew "jq"
brew "libpq"
brew "mas"
brew "openjdk@11"
brew "pgcli"
brew "pipenv"
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "scala"
brew "terraform"
brew "tldr"
brew "tree"
brew "wget"
brew "zsh"
brew "coursier/formulas/coursier"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "alfred"
cask "dash"
cask "docker"
cask "dropbox"
cask "flux"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "kindle"
cask "miniconda"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "soundsource"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "akamud.vscode-theme-onedark"
vscode "bceskavich.theme-dracula-at-night"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "garytyler.darcula-pycharm"
vscode "hashicorp.terraform"
vscode "johnpapa.winteriscoming"
vscode "magicstack.MagicPython"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "natqe.reload"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "streetsidesoftware.code-spell-checker"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
{{- end }}

{{- if eq .location "work" }}
cask_args appdir: '/Applications'

tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
brew "ack"
brew "allure"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "awscli"
brew "pycparser"
brew "cffi"
brew "awscli-local"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "chezmoi"
brew "docker-compose"
brew "docutils"
brew "fd"
brew "gnutls"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "git-flow-avh"
brew "gnupg"
brew "guile"
brew "helm"
brew "jena"
brew "jq"
brew "kubernetes-cli"
brew "maven"
brew "neo4j"
brew "node"
brew "ollama"
brew "openvpn", restart_service: true
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "rustup"
brew "scala"
brew "tfenv"
brew "tldr"
brew "tree"
brew "ttyd", args: ["HEAD"]
brew "uv"
brew "watch"
brew "wget"
brew "zsh"
brew "charmbracelet/tap/vhs"
brew "hashicorp/tap/vault"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "alfred", args: { appdir: "/Applications" }
cask "amazon-workspaces"
cask "dash", args: { appdir: "/Applications" }
cask "docker"
cask "flux", args: { appdir: "/Applications" }
cask "font-jetbrains-mono", args: { appdir: "/Applications" }
cask "font-jetbrains-mono-nerd-font", args: { appdir: "/Applications" }
cask "font-meslo-lg-nerd-font", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "lens", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alpha4.jsonl"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-close-tag"
vscode "gitlab.gitlab-workflow"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "ibm.output-colorizer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "stardog-union.stardog-rdf-grammars"
vscode "stardog-union.vscode-langserver-sparql"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
{{- end }}
